[{"content_titles": "InSight's 'Mole' Team Peers into the Pit", "previews": "Efforts to save the heat probe continue."}, {"content_titles": "My Culture, My Voice", "previews": "In honor of Hispanic Heritage Month, Christina Hernandez, an instrument engineer on the Mars 2020 mission, talks about her childhood and journey to NASA."}, {"content_titles": "NASA's Perseverance Rover Goes Through Trials by Fire, Ice, Light and Sound", "previews": "The agency's new Mars rover is put through a series of tests in vacuum chambers, acoustic chambers and more to get ready for the Red Planet."}, {"content_titles": "Follow NASA's Perseverance Rover in Real Time on Its Way to Mars", "previews": "A crisply rendered web application can show you where the agency's Mars 2020 mission is right now as it makes its way to the Red Planet for a Feb. 18, 2021, landing."}, {"content_titles": "7 Things to Know About the Mars 2020 Perseverance Rover Mission", "previews": "NASA's next rover to the Red Planet is slated to launch no earlier than July 30. These highlights will get you up to speed on the ambitious mission."}, {"content_titles": "NASA's Perseverance Mars Rover Gets Balanced", "previews": "The mission team performed a crucial weight-balancing test on the rover in preparation for this summer's history-making launch to the Red Planet."}, {"content_titles": "NASA's Perseverance Rover Is Midway to Mars ", "previews": "Sometimes half measures can be a good thing – especially on a journey this long. The agency's latest rover only has about 146 million miles left to reach its destination."}, {"content_titles": "Hear Audio From NASA's Perseverance As It Travels Through Deep Space", "previews": "The first to be rigged with microphones, the agency's latest Mars rover picked up the subtle sounds of its own inner workings during interplanetary flight."}, {"content_titles": "NASA Prepares for Moon and Mars With New Addition to Its Deep Space Network", "previews": "Robotic spacecraft will be able to communicate with the dish using radio waves and lasers."}, {"content_titles": "Curiosity Mars Rover's Summer Road Trip Has Begun", "previews": "After more than a year in the \"clay-bearing unit,\" Curiosity is making a mile-long journey around some deep sand so that it can explore higher up Mount Sharp."}, {"content_titles": "NASA's Ingenuity Mars Helicopter Recharges Its Batteries in Flight", "previews": "Headed to the Red Planet with the Perseverance rover, the pioneering helicopter is powered up for the first time in interplanetary space as part of a systems check."}, {"content_titles": "NASA Mars Mission Connects With Bosnian and Herzegovinian Town", "previews": "A letter from NASA was presented to the mayor of Jezero, Bosnia-Herzegovina, honoring the connection between the town and Jezero Crater, the Mars 2020 rover landing site."}, {"content_titles": "How NASA's Perseverance Mars Team Adjusted to Work in the Time of Coronavirus ", "previews": "Like much of the rest of the world, the Mars rover team is pushing forward with its mission-critical work while putting the health and safety of their colleagues and community first."}, {"content_titles": "NASA Invites Students to Name Mars 2020 Rover", "previews": "Through Nov. 1, K-12 students in the U.S. are encouraged to enter an essay contest to name NASA's next Mars rover."}, {"content_titles": "Two Rovers to Roll on Mars Again: Curiosity and Mars 2020", "previews": "They look like twins. But under the hood, the rover currently exploring the Red Planet and the one launching there this summer have distinct science tools and roles to play."}]