[{"content_titles": "Mars 2020 Unwrapped and Ready for More Testing", "previews": "In time-lapse video, bunny-suited engineers remove the inner layer of protective foil on NASA's Mars 2020 rover after it was relocated for testing."}, {"content_titles": "6 Things to Know About NASA's Ingenuity Mars Helicopter", "previews": "The first helicopter attempting to fly on another planet is a marvel of engineering. Get up to speed with these key facts about its plans."}, {"content_titles": "NASA's Mars 2020 Rover Goes Coast-to-Coast to Prep for Launch", "previews": "The agency's first step in returning rocks from Mars just arrived at Kennedy Space Center. The Mars 2020 team now begins readying for a launch to the Red Planet this July."}, {"content_titles": "NASA Adds Return Sample Scientists to Mars 2020 Leadership Team", "previews": "The leadership council for Mars 2020 science added two new members who represent the interests of scientists destined to handle and study the first samples from Red Planet."}, {"content_titles": "Naming a NASA Mars Rover Can Change Your Life", "previews": "Want to name the robotic scientist NASA is sending to Mars in 2020? The student who named Curiosity — the rover currently exploring Mars — will tell you this is an opportunity worth taking."}, {"content_titles": "Screening Soon: 'The Pathfinders' Trains Lens on Mars", "previews": "With the Mars 2020 mission ramping up, the documentary — the first of four about past JPL missions to the Red Planet to be shown at Caltech — tells a gripping backstory."}, {"content_titles": "MOXIE Could Help Future Rockets Launch Off Mars", "previews": "NASA's Perseverance rover carries a device to convert Martian air into oxygen that, if produced on a larger scale, could be used not just for breathing, but also for fuel."}, {"content_titles": "NASA to Reveal Name of Its Next Mars Rover", "previews": "After a months-long contest among students to name NASA's newest Mars rover, the agency will reveal the winning name — and the winning student — this Thursday. "}, {"content_titles": "NASA's Perseverance Rover Goes Through Trials by Fire, Ice, Light and Sound", "previews": "The agency's new Mars rover is put through a series of tests in vacuum chambers, acoustic chambers and more to get ready for the Red Planet."}, {"content_titles": "All About the Laser (and Microphone) Atop Mars 2020, NASA's Next Rover", "previews": "SuperCam is a rock-vaporizing instrument that will help scientists hunt for Mars fossils."}, {"content_titles": "NASA Invites Students to Name Mars 2020 Rover", "previews": "Through Nov. 1, K-12 students in the U.S. are encouraged to enter an essay contest to name NASA's next Mars rover."}, {"content_titles": "Mars Is Getting a New Robotic Meteorologist", "previews": "Sensors on NASA's Perseverance will help prepare for future human exploration by taking weather measurements and studying dust particles."}, {"content_titles": "Follow NASA's Perseverance Rover in Real Time on Its Way to Mars", "previews": "A crisply rendered web application can show you where the agency's Mars 2020 mission is right now as it makes its way to the Red Planet for a Feb. 18, 2021, landing."}, {"content_titles": "Mars 2020 Stands on Its Own Six Wheels", "previews": "In time-lapse video, taken at JPL, captures the first time NASA's Mars 2020 rover carries its full weight on its legs and wheels."}, {"content_titles": "Mars InSight Lander to Push on Top of the 'Mole'", "previews": "Engineers have a plan for pushing down on the heat probe, which has been stuck at the Martian surface for a year."}]